ГТС/УТГТС/Catalogs/Глоссарий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Глоссарий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХэшДанныхПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыКонфигурации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияГлоссария</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХэшДанныхПоставщика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/Catalogs/Глоссарий/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоРедактирования = ПравоДоступа("Изменение", Метаданные.Справочники.Глоссарий);
	
	Элементы.ЗагрузитьИзТаблицы.Видимость             = ЕстьПравоРедактирования;
	Элементы.СписокКонтекстноеМенюЗагрузить.Видимость = ЕстьПравоРедактирования;
	
	// СтандартныеПодсистемы.БазоваяФункциональность
	МультиязычностьСервер.ПриСозданииНаСервере(ЭтотОбъект, ,"Список");
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ЯзыкОписаний = ТекущийЯзык().КодЯзыка; 
	Если Не ЗначениеЗаполнено(ЯзыкОписаний) Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеСтрокКлючам               = Новый Соответствие;
	ЭлементыГлоссарияДляПолученияОписания = Новый Массив;
	
	Для Каждого СтрокаСписка Из Строки Цикл
		
		СоответствиеСтрокКлючам.Вставить(СтрокаСписка.Ключ, СтрокаСписка.Значение);
		
		ЭлементыГлоссарияДляПолученияОписания.Добавить(СтрокаСписка.Ключ);
		
	КонецЦикла;
	
	Если СоответствиеСтрокКлючам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ГлоссарийОписанияГлоссария.Ссылка КАК Ссылка,
	|	ГлоссарийОписанияГлоссария.Описание КАК Описание
	|ИЗ
	|	Справочник.Глоссарий.ОписанияГлоссария КАК ГлоссарийОписанияГлоссария
	|ГДЕ
	|	ГлоссарийОписанияГлоссария.Ссылка В(&Глоссарии)
	|	И ГлоссарийОписанияГлоссария.КодЯзыка = &КодЯзыка";
	
	Запрос.УстановитьПараметр("Глоссарии", ЭлементыГлоссарияДляПолученияОписания);
	Запрос.УстановитьПараметр("КодЯзыка",  ТекущийЯзык().КодЯзыка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеРеквизита = Выборка.Описание.Получить();
		
		Если ТипЗнч(ДанныеРеквизита) = Тип("ФорматированныйДокумент") Тогда
			ОписаниеСтрокиСписка = ДанныеРеквизита.ПолучитьТекст();
			МассивНеСтрокОписания = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОписаниеСтрокиСписка, Символы.ПС);
			МассивНеПустыхСтрок = Новый Массив;
			Для Каждого СтрокаОписания Из МассивНеСтрокОписания Цикл
				Если ПустаяСтрока(СтрокаОписания) Тогда
					Продолжить;
				КонецЕсли;
				МассивНеПустыхСтрок.Добавить(СтрокаОписания);
			КонецЦикла;
			ОписаниеСтрокиСписка = СтрСоединить(МассивНеПустыхСтрок);
			СтрокаСписка =  СоответствиеСтрокКлючам.Получить(Выборка.Ссылка); //СтрокаДинамическогоСписка
			Если СтрокаСписка <> Неопределено Тогда
				СтрокаСписка.Данные.ОписаниеГлоссария = ОписаниеСтрокиСписка; // 
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	ОткрытьФорму("Справочник.Глоссарий.Форма.ФормаЗагрузкиГлоссария",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВыделенныеЭлементы(Команда)
	
	МассивВыбранных = Элементы.Список.ВыделенныеСтроки;
	
	Если МассивВыбранных.Количество()>0 Тогда
		Парам  = Новый Структура;
		Парам.Вставить("ВыделенныеЭлементы", МассивВыбранных);
		ОткрытьФорму("Справочник.ДемонстрационныеСценарии.Форма.ПереводНесколькихСценариев",Парам);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать хотя бы один элемент или группу'"), 20);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
